In [61]:
import pandas as pd
#Creation of Dataframe
df=pd.read_csv('student_csv.csv')
print(df.head())
print(df.tail())
print(df.describe())
print(df.info())
print(df.index)

   StudentID     Name  Age Gender Branch  Year  CGPA  Attendance       City
0        101    Arjun   18      M    CSE     1   8.2          92  Bangalore
1        102    Rahul   19      M    ISE     1   7.5          85     Mysore
2        103     Neha   18      F    CSE     1   9.1          96      Delhi
3        104    Priya   20      F    ECE     2   8.7          90    Chennai
4        105  Karthik   21      M     ME     3   6.9          78  Hyderabad
   StudentID    Name  Age Gender Branch  Year  CGPA  Attendance        City
5        106   Aditi   19      F    CSE     2   9.3          98      Mumbai
6        107   Rohan   22      M     CE     4   7.2          80        Pune
7        108   Sneha   20      F    EEE     2   8.0          88  Coimbatore
8        109  Vikram   21      M    CSE     3   8.5          91   Bangalore
9        110  Ananya   18      F    ISE     1   9.0          95     Kolkata
       StudentID        Age       Year       CGPA  Attendance
count   10.00000  10.000000  10.000000  10.000000   10.000000
mean   105.50000  19.600000   2.000000   8.240000   89.300000
std      3.02765   1.429841   1.054093   0.830261    6.650814
min    101.00000  18.000000   1.000000   6.900000   78.000000
25%    103.25000  18.250000   1.000000   7.625000   85.750000
50%    105.50000  19.500000   2.000000   8.350000   90.500000
75%    107.75000  20.750000   2.750000   8.925000   94.250000
max    110.00000  22.000000   4.000000   9.300000   98.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StudentID   10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Gender      10 non-null     object
 4   Branch      10 non-null     object
 5   Year        10 non-null     int64
 6   CGPA        10 non-null     float64
 7   Attendance  10 non-null     int64
 8   City        10 non-null     object
dtypes: float64(1), int64(4), object(4)
memory usage: 852.0+ bytes
None
RangeIndex(start=0, stop=10, step=1)

# Accessing of Data can be done using head tail and etc

In [62]:
df.sample(10)

#LOC AND ILOC FUNCTIONS
print(df.loc[[0,2,4,5]])   #a LIST OF ROWS
print(df.loc[0:3])         #A slice of rows
print(df.loc[0:5,'StudentID'])  #Range of rows with a specific column
#df.loc[0:[list of columns]] gives a range of columns for a specific rows
df.iloc[0:20,:]   #Same shi but like with indexes on both sides

   StudentID     Name  Age Gender Branch  Year  CGPA  Attendance       City
0        101    Arjun   18      M    CSE     1   8.2          92  Bangalore
2        103     Neha   18      F    CSE     1   9.1          96      Delhi
4        105  Karthik   21      M     ME     3   6.9          78  Hyderabad
5        106    Aditi   19      F    CSE     2   9.3          98     Mumbai
   StudentID   Name  Age Gender Branch  Year  CGPA  Attendance       City
0        101  Arjun   18      M    CSE     1   8.2          92  Bangalore
1        102  Rahul   19      M    ISE     1   7.5          85     Mysore
2        103   Neha   18      F    CSE     1   9.1          96      Delhi
3        104  Priya   20      F    ECE     2   8.7          90    Chennai
0    101
1    102
2    103
3    104
4    105
5    106
Name: StudentID, dtype: int64

   StudentID     Name  Age Gender Branch  Year  CGPA  Attendance        City
0        101    Arjun   18      M    CSE     1   8.2          92   Bangalore
1        102    Rahul   19      M    ISE     1   7.5          85      Mysore
2        103     Neha   18      F    CSE     1   9.1          96       Delhi
3        104    Priya   20      F    ECE     2   8.7          90     Chennai
4        105  Karthik   21      M     ME     3   6.9          78   Hyderabad
5        106    Aditi   19      F    CSE     2   9.3          98      Mumbai
6        107    Rohan   22      M     CE     4   7.2          80        Pune
7        108    Sneha   20      F    EEE     2   8.0          88  Coimbatore
8        109   Vikram   21      M    CSE     3   8.5          91   Bangalore
9        110   Ananya   18      F    ISE     1   9.0          95     Kolkata

# To convert the index row into the specific column

In [63]:
df.index=df['StudentID']
#Now instead of using the index values for rows u can use specific row names

#   u    can sort values of a column based on parameters

In [64]:
df1=df.copy()
df1.sort_values('Attendance', ascending=False)
df1

,StudentID,Name,Age,Gender,Branch,Year,CGPA,Attendance,City
StudentID,,,,,,,,,
101,101,Arjun,18,M,CSE,1,8.2,92,Bangalore
102,102,Rahul,19,M,ISE,1,7.5,85,Mysore
103,103,Neha,18,F,CSE,1,9.1,96,Delhi
104,104,Priya,20,F,ECE,2,8.7,90,Chennai
105,105,Karthik,21,M,ME,3,6.9,78,Hyderabad
106,106,Aditi,19,F,CSE,2,9.3,98,Mumbai
107,107,Rohan,22,M,CE,4,7.2,80,Pune
108,108,Sneha,20,F,EEE,2,8.0,88,Coimbatore
109,109,Vikram,21,M,CSE,3,8.5,91,Bangalore
110,110,Ananya,18,F,ISE,1,9.0,95,Kolkata

#  A case where u might need to iterate through rows

In [65]:
for index,rows in df.iterrows():
    print(rows['StudentID'])

101
102
103
104
105
106
107
108
109
110

#  Filtering data

In [66]:
#df[' lap_time_seconds']=pd.to_numeric(df[' lap_time_seconds'],errors='coerce')
df[(df['Attendance']>80.555) & (df['Attendance']<100.000)] #Basically vectorized operations but u gotta define it inside a df[can be a logical expression ]
df[(df['Attendance']>80.555) & (df['Attendance']<100.000)]['Name']  #Does the same thing but the second set of [] helps to only print a select columns defined within []
df.loc[df['Attendance']>80.555,['Name']]

             Name
StudentID
101         Arjun
102         Rahul
103          Neha
104         Priya
106         Aditi
108         Sneha
109        Vikram
110        Ananya

# Filtering using string operations
    -Assume u have a dataset df having a column 'NAME' and u want to pick up strings that start with the word 'real' then u use
     df[df['NAME'].str.contains('real')]'''
     -contains() accepts a parameter case  ->True if u need it to be case sensitive and false if not
     -U can use regex as the string to find

 # isin filter
 ### given column or list of columns isin function checks the membership of elements of this column in the given parameter and conditions can also be passed
 ### Ex: df[df['born_country'].isin(['USA','FRA'] & df['name']=='Samuel']

In [67]:
df[df['Branch'].isin(['CSE','ISE'])]

,StudentID,Name,Age,Gender,Branch,Year,CGPA,Attendance,City
StudentID,,,,,,,,,
101,101,Arjun,18,M,CSE,1,8.2,92,Bangalore
102,102,Rahul,19,M,ISE,1,7.5,85,Mysore
103,103,Neha,18,F,CSE,1,9.1,96,Delhi
106,106,Aditi,19,F,CSE,2,9.3,98,Mumbai
109,109,Vikram,21,M,CSE,3,8.5,91,Bangalore
110,110,Ananya,18,F,ISE,1,9.0,95,Kolkata

# Adding/Removing Columns
## Adding a new column can just be done by writing df['new_column_name']=A list of elements to be stored as a column

## For removing we use df.drop()
    -drop() defualt does not modify og dataframe but can be modified by using the inplce paramter to be True

## Converting a list of dates to datetime column
    -df['dob']=pd.to_datetime(df['dob']

## To access methods of a datetime object u use .dt.year, dt.day, dt.month etc

# Saving a dataframe into a required file

In [68]:
df1.to_csv('C:\\Users\ASUS\PyCharmMiscProject\Python pactice for motorsport\student_csv.csv',index=False) #Index=False means it wont create a new column just for the index values

# Apply Function

In [71]:
df['CODE']=df['City'].apply(lambda x:str(x)[0:3].upper())       #Always takes a function as the main arguement can have a parameter axis =0 or 1 to perform operations on all rows and all columns
df

,StudentID,Name,Age,Gender,Branch,Year,CGPA,Attendance,City,CODE
StudentID,,,,,,,,,,
101,101,Arjun,18,M,CSE,1,8.2,92,Bangalore,BAN
102,102,Rahul,19,M,ISE,1,7.5,85,Mysore,MYS
103,103,Neha,18,F,CSE,1,9.1,96,Delhi,DEL
104,104,Priya,20,F,ECE,2,8.7,90,Chennai,CHE
105,105,Karthik,21,M,ME,3,6.9,78,Hyderabad,HYD
106,106,Aditi,19,F,CSE,2,9.3,98,Mumbai,MUM
107,107,Rohan,22,M,CE,4,7.2,80,Pune,PUN
108,108,Sneha,20,F,EEE,2,8.0,88,Coimbatore,COI
109,109,Vikram,21,M,CSE,3,8.5,91,Bangalore,BAN
110,110,Ananya,18,F,ISE,1,9.0,95,Kolkata,KOL